app/controllers/pubs_controller.rb

  def index
    @pubs = Pub.all
---
SELECT `pubs`.* FROM `pubs`

  def create
    @pub = Pub.new(pub_params)

    respond_to do |format|
      if @pub.save
---
INSERT INTO `pubs` (`city`, `created_at`, `name`, `street`, `updated_at`) VALUES ('Liberec', '2014-07-25 23:48:17', 'Hostinec U Vávrů', '', '2014-07-25 23:48:17')

    def set_pub
      @pub = Pub.find(params[:id])
---
SELECT  `pubs`.* FROM `pubs`  WHERE `pubs`.`id` = 1 LIMIT 1